programming/cpp/histogram.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>histogram.cpp</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">histogram.cpp</h1>
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;iostream&gt;
#include &lt;cctype&gt;

using namespace std;

const int No_Of_Letters = 26;

class Histogram {
private:
  int the_letter_freq[No_Of_Letters];
  int max_freq;

public:
  Histogram();
  void add_letter(const char);
  void print() const;
  void calc_max_freq();
};

Histogram::Histogram()
{
  int ch_pos;

  for (ch_pos=0; ch_pos &lt; No_Of_Letters; ch_pos++)
    {
      the_letter_freq[ch_pos] = 0;
    }
}

void Histogram::add_letter(const char letter_to_add)
{
  int ch_pos;
  char c = letter_to_add;

  if (islower(c)) {
    c = toupper(c);
  }

  if (isupper (c)) {
    ch_pos = (int) c - (int) 'A';
    the_letter_freq[ch_pos] = the_letter_freq[ch_pos] + 1;
  }
}

void Histogram::print() const
{
  for (int j = max_freq; j &gt; 0; j--)
    {
      cout &lt;&lt; "|" ;
      for (int ch_pos = 0;
	   ch_pos &lt; No_Of_Letters; ch_pos++) {
	if (the_letter_freq[ch_pos] &gt;= j)
	  cout &lt;&lt; "*";
	else
	  cout &lt;&lt; " ";
      }
      cout &lt;&lt; "|" &lt;&lt; endl;
    }
  cout &lt;&lt;" --------------------------"&lt;&lt;endl;
  cout &lt;&lt;" ABCDEFGHIJKLMNOPQRSTUVQXYZ" &lt;&lt; endl;
}

void Histogram::calc_max_freq()
{
  int max = 0;
  for ( int ch_pos = 0; ch_pos &lt; No_Of_Letters; ch_pos++)
    {
      if (the_letter_freq[ch_pos] &gt; max)
	max = the_letter_freq[ch_pos];
    }
  max_freq = max;
}

int main()
{
  Histogram hist;
  char ch;

  do
    {
      cin &gt;&gt; ch;
      hist.add_letter (ch);
    }
  while (ch != '#');

  hist.calc_max_freq();
  hist.print();
}
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
